Repository: rodrigocastrolima/twogetherapp
Catalog: lib/l10n/app_*.arb
Languages: pt

# loginWelcomeMessage
source: Welcome back!
pt: Bem-vindo de volta!

# loginPassword
source: Password
pt: Senha

# loginRememberMe
source: Remember me
pt: Lembrar-me

# loginButton
source: Login
pt: Entrar

# loginForgotPassword
source: Forgot Password?
pt: Esqueceu sua senha?

# adminRetailUsers
source: Retail Users
pt: Usuários Varejistas

# adminReports
source: Reports
pt: Relatórios

# adminOpportunities
source: Opportunities
pt: Oportunidades

# adminDashboard
source: Dashboard
pt: Painel

# adminUserManagement
source: User Management
pt: Gerenciamento de Usuários

# adminUserManagementDescription
source: Create and manage user accounts
pt: Criar e gerenciar contas de usuário

# adminSystemConfig
source: System Configuration
pt: Configuração do Sistema

# adminSystemConfigDescription
source: Advanced system settings
pt: Configurações avançadas do sistema

source: Admin Profile
pt: Perfil de Administrador

source: Admin Preferences
pt: Preferências de Administrador

source: New Reseller
pt: Novo Revendedor

# homeWelcome
source: Welcome
pt: Bem-vindo

# homeEarnings
source: Earnings
pt: Ganhos

# homeCommissionEarnings
source: Commission Earnings
pt: Ganhos de Comissões

# homeServices
source: Add New Service
pt: Adicionar Novo Serviço

# homeViewDetails
source: View Details
pt: Ver Detalhes

# homeNotifications
source: Notifications
pt: Notificações

# homeNoNotifications
source: No notifications
pt: Sem notificações

# homeNotificationMeeting
source: Meeting Scheduled
pt: Reunião Agendada

# homeNotificationMeetingDesc
source: You have a meeting scheduled for today at 2 PM
pt: Você tem uma reunião agendada para hoje às 14h

# homeNotificationRequest
source: New Service Request
pt: Nova Solicitação de Serviço

# homeNotificationRequestDesc
source: A new service request requires your attention
pt: Uma nova solicitação de serviço requer sua atenção

# homeNotificationPayment
source: Payment Received
pt: Pagamento Recebido

# homeNotificationPaymentDesc
source: Commission payment has been processed
pt: Pagamento de comissão processado

# homeQuickActionsTitle
source: Quick Actions
pt: Ações Rápidas

# homeQuickActionTransferLabel
source: National Transfer
pt: Transferência Nacional

# homeQuickActionPayBillsLabel
source: Pay Services
pt: Pagar Serviços

# homeQuickActionTopUpLabel
source: Top-up Phone
pt: Recarga Celular

# homeQuickActionShareIbanLabel
source: Share IBAN
pt: Compartilhar IBAN

# homeCreateNewServiceButton
source: Create New Service
pt: Criar Novo Serviço

# homeNotificationsPending
source: Pending
pt: Pendentes

# homeNotificationExamplePurchaseTitle
source: PURCHASE {purchaseId}
pt: COMPRA {purchaseId}

# homeNotificationExampleRejectionTitle
source: Submission Rejected
pt: Solicitação Rejeitada

# homeNotificationExampleRejectionDesc
source: Your submission {submissionId} was rejected
pt: Sua solicitação {submissionId} foi rejeitada

# homeCommissionBoxTitle
source: COMMISSIONS
pt: COMISSÕES

# homeCommissionBoxDetailsButton
source: VIEW DETAILS
pt: VER DETALHES

# chatSupportTitle
source: Support
pt: Suporte

# chatSupportSubtitle
source: Our team is here to help with your inquiries.
pt: Nossa equipe está aqui para ajudar com suas dúvidas.

# chatSupportName
source: Twogether Support
pt: Suporte Twogether

# chatYou
source: You
pt: Você

# chatMessage
source: Message
pt: Mensagem

# chatSendMessage
source: Send a message
pt: Enviar uma mensagem

# chatSendMessagePrompt
source: Send a message to get started
pt: Envie uma mensagem para começar

# chatLoadingMessages
source: Loading messages...
pt: Carregando mensagens...

# chatNoMessages
source: No messages yet
pt: Sem mensagens

# chatErrorLoading
source: Error loading messages
pt: Erro ao carregar mensagens

# chatTryAgainLater
source: Please try again later
pt: Por favor, tente novamente mais tarde

# chatRetry
source: Retry
pt: Tentar novamente

# chatWelcomeTitle
source: Welcome to Support
pt: Bem-vindo ao Suporte

# chatWelcomeMessage
source: Connect directly with our support team for personalized assistance with your account, services, and any questions you may have.
pt: Conecte-se diretamente com nossa equipe de suporte para obter assistência personalizada com sua conta, serviços e quaisquer perguntas que você possa ter.

# chatSendMessageError
source: Error sending message: {error}
pt: Erro ao enviar mensagem: {error}

# chatSelectImageError
source: Error selecting image: {error}
pt: Erro ao selecionar imagem: {error}

# chatAdminEmptyState
source: No messages yet
pt: Sem mensagens ainda

# chatErrorGenericRetry
source: Please try again later
pt: Por favor, tente novamente mais tarde

# chatDefaultSenderName
source: User
pt: Utilizador

# chatImageLoadError
source: Failed to load image
pt: Falha ao carregar imagem

# chatImageNotAvailable
source: Image not available
pt: Imagem não disponível

# chatImageLoadFailed
source: Image failed to load
pt: Falha ao carregar imagem

# chatImageRetryLabel
source: Tap to retry {count}/{maxRetries}
pt: Toque para tentar novamente {count}/{maxRetries}

# chatImageCannotDisplay
source: Can't display image
pt: Não é possível exibir a imagem

# chatImageOpenInBrowser
source: Tap to open in browser
pt: Toque para abrir no navegador

# chatInputHintAdmin
source: Message
pt: Mensagem

# chatDebugDialogTitle
source: Image Loading Debug Info
pt: Info Depuração Carregamento Imagem

# chatDebugDialogTestsLabel
source: Tests:
pt: Testes:

# chatDebugDialogRunUrlTestButton
source: Run URL Tests
pt: Executar Testes de URL

# chatDebugDialogImageUrlInfoButton
source: Image URL Info
pt: Info URL Imagem

# chatDebugDialogCloseButton
source: Close
pt: Fechar

# chatDebugDialogFirebaseTitle
source: Firebase Storage URL Issue
pt: Problema URL Firebase Storage

# chatDebugDialogFirebaseContent
source: Firebase Storage URLs often have CORS issues in web browsers that prevent direct loading.
pt: URLs do Firebase Storage frequentemente têm problemas de CORS em navegadores web que impedem o carregamento direto.

# chatDebugDialogFirebaseSolutionsTitle
source: Possible solutions:
pt: Soluções possíveis:

# chatDebugDialogFirebaseSolution1
source: 1. Configure Firebase Storage CORS settings
pt: 1. Configurar definições CORS do Firebase Storage

# chatDebugDialogFirebaseSolution2
source: 2. Use a server proxy to bypass CORS
pt: 2. Usar um servidor proxy para contornar o CORS

# chatDebugDialogFirebaseSolution3
source: 3. Switch to use a CachedNetworkImageProvider
pt: 3. Mudar para usar um CachedNetworkImageProvider

# reauthErrorUserNotFound
source: Could not find user information for re-authentication.
pt: Não foi possível encontrar informação do utilizador para reautenticação.

# reauthRequiredTitle
source: Re-authentication Required
pt: Reautenticação Necessária

# reauthRequiredMessage
source: For your security, please enter your current password to continue.
pt: Para sua segurança, por favor introduza a sua palavra-passe atual para continuar.

# reauthCurrentPasswordLabel
source: Current Password
pt: Palavra-passe Atual

source: Cancel
pt: Cancelar

source: Confirm
pt: Confirmar

# reauthFailedError
source: Re-authentication failed: {errorCode}.
pt: Reautenticação falhou: {errorCode}.

# reauthFailedGenericError
source: Re-authentication failed. Please try again.
pt: Reautenticação falhou. Por favor, tente novamente.

# passwordUpdateFailedAfterReauthError
source: Password update failed after re-authentication: {errorCode}.
pt: Atualização da palavra-passe falhou após reautenticação: {errorCode}.

# passwordUpdateFailedAfterReauthGenericError
source: Password update failed after re-authentication. Please try again.
pt: Atualização da palavra-passe falhou após reautenticação. Por favor, tente novamente.

# reauthCancelledError
source: Password change cancelled because re-authentication was not completed.
pt: Alteração de palavra-passe cancelada porque a reautenticação não foi concluída.

# passwordUpdateSuccessMessage
source: Password updated successfully!
pt: Palavra-passe atualizada com sucesso!

# passwordUpdateCompleteFirstLoginError
source: Password updated, but failed to complete the first login process. Please try logging in again.
pt: Palavra-passe atualizada, mas falhou ao concluir o processo de primeiro login. Por favor, tente iniciar sessão novamente.

# validationPasswordEmpty
source: Password cannot be empty.
pt: A palavra-passe não pode estar vazia.

# validationPasswordMismatch
source: Passwords do not match.
pt: As palavras-passe não coincidem.

# validationPasswordTooShort
source: Password must be at least 8 characters long.
pt: A palavra-passe deve ter pelo menos 8 caracteres.

# firebaseAuthError
source: Authentication error: {errorCode}
pt: Erro de autenticação: {errorCode}

# passwordUpdateFailedGenericError
source: Failed to update password. Please try again.
pt: Falha ao atualizar a senha. Por favor, tente novamente.

# loginPageTitle
source: Login
pt: Iniciar Sessão

# salesforceSubmissionSuccess
source: Service submission successful!
pt: Submissão de serviço bem-sucedida!

# salesforceSubmissionError
source: Error submitting service: {error}
pt: Erro ao submeter serviço: {error}

# changePasswordTitle
source: Change Password
pt: Alterar Palavra-passe

# changePasswordSubtitle
source: Please set a new password for your account.
pt: Por favor, defina uma nova palavra-passe para a sua conta.

# changePasswordNewLabel
source: New Password
pt: Nova Palavra-passe

# changePasswordConfirmLabel
source: Confirm Password
pt: Confirmar Palavra-passe

# changePasswordButton
source: Change Password
pt: Alterar Palavra-passe

# fileUploadRemoveTooltip
source: Remove file
pt: Remover ficheiro

# servicesPageTitle
source: What type of service?
pt: Qual tipo de serviço?

# servicesEnergyPageTitle
source: What type of energy service?
pt: Qual tipo de serviço de energia?

# servicesClientTypePageTitle
source: Select your provider
pt: Selecione seu fornecedor

# servicesClientTypePageSubtitle
source: Choose based on client type
pt: Escolha com base no tipo de cliente

# servicesClientTypeCommercialTitle
source: Business Clients
pt: Clientes Comerciais

# servicesClientTypeCommercialSubtitle
source: For companies and businesses
pt: Para empresas e negócios

# servicesClientTypeResidentialTitle
source: Residential Clients
pt: Clientes Residenciais

# servicesClientTypeResidentialSubtitle
source: For homes and families
pt: Para residências e famílias

# servicesFormTitle
source: Client Data
pt: Dados do Cliente

# servicesFormCompanyNameLabel
source: Company Name
pt: Nome da Empresa

# servicesFormCompanyNameHint
source: Enter company name (optional)
pt: Digite o nome da empresa

# servicesFormResponsibleNameLabel
source: Responsible Name
pt: Nome do Responsável

# servicesFormResponsibleNameHint
source: Enter responsible person's full name
pt: Digite o nome do responsável

# servicesFormNifLabel
source: Tax ID (NIF)
pt: NIF

# servicesFormNifHint
source: Enter the Tax ID (NIF)
pt: Digite o NIF

# servicesFormEmailHint
source: Enter the email
pt: Digite o email

# servicesFormPhoneLabel
source: Phone
pt: Telefone

# servicesFormPhoneHint
source: Enter the phone number
pt: Digite o telefone

# servicesSubmitButtonLabel
source: Submit
pt: Enviar

# servicesStepInvalid
source: Invalid step
pt: Passo inválido

# servicesSubmissionError
source: Error submitting form
pt: Erro ao enviar formulário

# servicesSubmissionErrorGeneric
source: Error submitting form: {error}
pt: Erro ao enviar formulário: {error}

# servicesUserAuthError
source: User not authenticated
pt: Utilizador não autenticado

# fileUploadHint
source: Upload a photo or PDF of the invoice
pt: Carregue uma foto ou PDF da fatura

# fileUploadButtonLabel
source: Upload Invoice
pt: Carregar Fatura

# servicesSubmissionSuccessMessage
source: Service request submitted successfully!
pt: Pedido de serviço enviado com sucesso!
